Repository: SamindiS/Autism_Screening_Tool_25-26J-273
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# scaleFrustration2
source: Low
si: අඩු
ta: குறைந்த

# scaleFrustration3
source: Moderate
si: මධ්‍යම
ta: மிதமான

# scaleFrustration4
source: Good
si: හොඳ
ta: நல்ல

# scaleFrustration5
source: Excellent
si: විශිෂ්ට
ta: சிறந்த

# scaleInstructions1
source: Very Poor
si: ඉතා දුර්වල
ta: மிகவும் மோசமான

# scaleInstructions2
source: Poor
si: දුර්වල
ta: மோசமான

# scaleInstructions3
source: Average
si: සාමාන්‍ය
ta: சராசரி

# scaleInstructions4
source: Good
si: හොඳ
ta: நல்ல

# scaleInstructions5
source: Excellent
si: විශිෂ්ට
ta: சிறந்த

# scaleOverall1
source: Concerning
si: කරදරකාරී
ta: கவலைக்குரிய

# scaleOverall2
source: Below Average
si: සාමාන්‍යයට වඩා අඩු
ta: சராசரிக்கு கீழே

# scaleOverall3
source: Average
si: සාමාන්‍ය
ta: சராசரி

# scaleOverall4
source: Good
si: හොඳ
ta: நல்ல

# scaleOverall5
source: Excellent
si: විශිෂ්ට
ta: சிறந்த

# scaleTask1
source: Not Observed
si: නිරීක්ෂණය නොකළ
ta: கவனிக்கப்படவில்லை

# scaleTask2
source: Poor
si: දුර්වල
ta: மோசமான

# scaleTask3
source: Fair
si: සාධාරණ
ta: நியாயமான

# scaleTask4
source: Good
si: හොඳ
ta: நல்ல

# scaleTask5
source: Excellent
si: විශිෂ්ට
ta: சிறந்த

# scaleBehavior1
source: Very Poor
si: ඉතා දුර්වල
ta: மிகவும் மோசமான

# scaleBehavior2
source: Poor
si: දුර්වල
ta: மோசமான

# scaleBehavior3
source: Average
si: සාමාන්‍ය
ta: சராசரி

# scaleBehavior4
source: Good
si: හොඳ
ta: நல்ல

# scaleBehavior5
source: Excellent
si: විශිෂ්ට
ta: சிறந்த

source: Next
si: ඊළඟ
ta: அடுத்து

source: Previous
si: කලින්
ta: முந்தைய

source: Submit
si: ඉදිරිපත් කරන්න
ta: சமர்ப்பி

source: Results
si: ප්‍රතිඵල
ta: முடிவுகள்

source: Assessment Results
si: තක්සේරු ප්‍රතිඵල
ta: மதிப்பீட்டு முடிவுகள்

source: Risk Level
si: අවදානම් මට්ටම
ta: ஆபத்து நிலை

source: Low
si: අඩු
ta: குறைந்த

source: Moderate
si: මධ්‍යම
ta: மிதமான

source: High
si: ඉහළ
ta: உயர்

source: Recommendations
si: නිර්දේශ
ta: பரிந்துரைகள்

# exportPdf
source: Export as PDF Report
si: PDF වාර්තාවක් ලෙස අපනයනය කරන්න
ta: PDF அறிக்கையாக ஏற்றுமதி செய்

source: Back to Dashboard
si: උපකරණ පුවරුවට ආපසු
ta: டாஷ்போர்டுக்குத் திரும்பு

source: Clinician Reflection
si: වෛද්‍ය පරාවර්තනය
ta: மருத்துவர் பிரதிபலிப்பு

source: Clinician Profile
si: වෛද්‍ය පැතිකඩ
ta: மருத்துவர் சுயவிவரம்

# clinicianReflection23
source: Clinician Reflection (2-3.5 yrs)
si: වෛද්‍ය පරාවර්තනය (වයස 2-3.5)
ta: மருத்துவர் பிரதிபலிப்பு (வயது 2-3.5)

# manualTasks
source: Manual Cognitive Flexibility Tasks
si: අතින් ඥානාත්මක නම්යශීලීභාව කාර්යයන්
ta: கைமுறை அறிவாற்றல் நெகிழ்வுத்தன்மை பணிகள்

source: Behavioral Observations
si: චර්යාත්මක නිරීක්ෂණ
ta: நடத்தை கவனிப்புகள்

source: Refresh
si: නැවුම් කරන්න
ta: புதுப்பி

# noResults
source: No children found
si: ළමයි හමු නොවීය
ta: குழந்தைகள் கிடைக்கவில்லை

# tryDifferentSearch
source: Try a different search term
si: වෙනත් සෙවුම් පදයක් උත්සාහ කරන්න
ta: வேறு தேடல் சொல்லை முயற்சிக்கவும்

source: Last assessment
si: අවසාන තක්සේරුව
ta: கடைசி மதிப்பீடு

# completedSessions
source: completed
si: සම්පූර්ණයි
ta: முடிந்தது

# pendingSession
source: Pending
si: පොරොත්තුවෙන්
ta: நிலுவையில்

# todayText
source: Today
si: අද
ta: இன்று

source: Yesterday
si: ඊයේ
ta: நேற்று

source: days ago
si: දින පෙර
ta: நாட்கள் முன்பு

source: Welcome Back!
si: සාදරයෙන් පිළිගනිමු!
ta: வரவேற்கிறோம்!

source: Assessment Components
si: තක්සේරු සංරචක
ta: மதிப்பீட்டு கூறுகள்

source: Restricted & Repetitive
si: සීමාකරන ලද සහ පුනරාවර්තන
ta: கட்டுப்படுத்தப்பட்ட மற்றும் மீண்டும் மீண்டும்

source: Auditory Checking
si: ශ්‍රවණ පරීක්ෂාව
ta: கேட்கும் சோதனை

source: Sound Processing
si: ශබ්ද සැකසීම
ta: ஒலி செயலாக்கம்

source: Visual Checking
si: දෘෂ්‍ය පරීක්ෂාව
ta: காட்சி சோதனை

source: Visual Processing
si: දෘෂ්‍ය සැකසීම
ta: காட்சி செயலாக்கம்

source: View Reports
si: වාර්තා බලන්න
ta: அறிக்கைகளைப் பார்

# rrbComingSoon
source: RRB Component - Coming Soon
si: RRB සංරචකය - ඉක්මනින් පැමිණේ
ta: RRB கூறு - விரைவில் வருகிறது

# auditoryComingSoon
source: Auditory Checking - Coming Soon
si: ශ්‍රවණ පරීක්ෂාව - ඉක්මනින් පැමිණේ
ta: கேட்கும் சோதனை - விரைவில் வருகிறது

# visualComingSoon
source: Visual Checking - Coming Soon
si: දෘෂ්‍ය පරීක්ෂාව - ඉක්මනින් පැමිණේ
ta: காட்சி சோதனை - விரைவில் வருகிறது

source: View Reports - Coming Soon
si: වාර්තා බලන්න - ඉක්මනින් පැමිණේ
ta: அறிக்கைகளைப் பார் - விரைவில் வருகிறது

source: System Information
si: පද්ධති තොරතුරු
ta: கணினி தகவல்

source: Version
si: අනුවාදය
ta: பதிப்பு

source: Status
si: තත්වය
ta: நிலை

source: Pilot Mode
si: පයිලට් ප්‍රකාරය
ta: பைலட் முறை

source: Mode
si: ප්‍රකාරය
ta: முறை

source: Offline First
si: අන්තර්ජාලය නොමැතිව පළමු
ta: ஆஃப்லைன் முதல்

# assessChildrenInfo
source: Assess children aged 2-6 years for cognitive flexibility and rule-switching abilities
si: 2-6 වසර වයසේ ළමයින්ගේ ඥානාත්මක නම්යශීලීභාවය සහ නීති මාරු කිරීමේ හැකියාවන් තක්සේරු කරන්න
ta: 2-6 வயது குழந்தைகளின் அறிவாற்றல் நெகிழ்வுத்தன்மை மற்றும் விதி மாற்றும் திறன்களை மதிப்பிடுங்கள்

# noChildrenFound
source: No children found matching "{query}"
si: "{query}" සමඟ ගැලපෙන ළමයින් හමු නොවීය
ta: "{query}" உடன் பொருந்தக்கூடிய குழந்தைகள் கிடைக்கவில்லை

source: SenseAI Dashboard
si: සෙන්ස්AI උපකරණ පුවරුව
ta: சென்ஸ்AI டாஷ்போர்டு

source: Add New Child
si: නව ළමයා එක් කරන්න
ta: புதிய குழந்தையைச் சேர்

source: Refreshed
si: නැවුම් කරන ලදී
ta: புதுப்பிக்கப்பட்டது

source: Error
si: දෝෂය
ta: பிழை

source: Coming Soon
si: ඉක්මනින් පැමිණේ
ta: விரைவில் வருகிறது

# logoutConfirmation
source: Are you sure you want to logout?
si: ඔබට ඉවත් වීමට අවශ්‍ය බව විශ්වාසද?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

source: Retry
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சி

# gameTitle
source: Flower Game
si: මල් ක්‍රීඩාව
ta: மலர் விளையாட்டு

# gameInstructions
source: Tap COLOR or SHAPE.
si: මල් දිහා බලන්න, පාට හරි හැඩය හරි තෝරන්න.
ta: நிறம் அல்லது வடிவம் தட்டவும்.

# gameInstructionsSimple
source: Tap COLOR or SHAPE.
si: මල් දිහා බලන්න, පාට හරි හැඩය හරි තෝරන්න.
ta: நிறம் அல்லது வடிவம் தட்டவும்.

# selectLanguage
source: Choose Language
si: භාෂාව තෝරන්න
ta: மொழியைத் தேர்ந்தெடு

# colorButton
source: COLOR
si: පාට
ta: நிறம்

# shapeButton
source: SHAPE
si: හැඩය
ta: வடிவம்

# currentRule
source: Rule
si: නීතිය
ta: விதி

# tapColorForPink
source: Tap COLOR!
si: පාට තෝරන්න!
ta: நிறம் தட்டவும்!

# tapShapeForRound
source: Tap SHAPE!
si: හැඩය තෝරන්න!
ta: வடிவம் தட்டவும்!

# greatJob
source: Good!
si: හොඳයි!
ta: நன்றாக!

source: Try again!
si: නැවත!
ta: மீண்டும்!

# gameComplete
source: Done!
si: ඉවරයි!
ta: முடிந்தது!

# wellDone
source: Good!
si: හොඳයි!
ta: நன்றாக!

# frogJumpGameTitle
source: Frog Jump Game!
si: ගෙම්බා පැනීමේ ක්‍රීඩාව!
ta: தவளை குதிக்கும் விளையாட்டு!

# frogJumpGameInstructions
source: Tap the HAPPY frogs when you see them! 😊
si: සතුටු ගෙම්බා දැකීමේදී ඔබන්න! 😊
ta: மகிழ்ச்சியான தவளைகளைப் பார்த்தால் தட்டவும்! 😊

# tapMe
source: ✅ TAP the happy frog!
si: ✅ සතුටු ගෙම්බා ඔබන්න!
ta: ✅ மகிழ்ச்சியான தவளை தட்டவும்!

# dontTap
source: ❌ DON'T tap sleepy turtle!
si: ❌ නිදි ගෙම්බා ඔබන්න එපා!
ta: ❌ தூங்கும் ஆமை தட்ட வேண்டாம்!

source: Get Ready!
si: සූදානම් වන්න!
ta: தயாராகுங்கள்!

# tapHappyFrog
source: Tap the Happy Frog! 🐸
si: සතුටු ගෙම්බා ඔබන්න! 🐸
ta: மகிழ்ச்சியான தவளை தட்டவும்! 🐸

# dontTapSleepyTurtle
source: Don't Tap! It's Sleepy! 🐢
si: ඔබන්න එපා! එය නිදි! 🐢
ta: தட்ட வேண்டாம்! அது தூங்குகிறது! 🐢
