Repository: SamindiS/Autism_Screening_Tool_25-26J-273
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appName
source: SenseAI
si: සෙන්ස්AI
ta: சென்ஸ்AI

source: Welcome
si: සාදරයෙන් පිළිගනිමු
ta: வரவேற்கிறோம்

source: Login
si: පිවිසීම
ta: உள்நுழைய

source: Register
si: ලියාපදිංචි වන්න
ta: பதிவு செய்

source: Logout
si: ඉවත් වන්න
ta: வெளியேறு

source: Dashboard
si: උපකරණ පුවරුව
ta: டாஷ்போர்டு

source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# ruleSwitching
source: Rule Switching Assessment
si: නීති මාරු කිරීමේ තක්සේරුව
ta: விதி மாற்ற மதிப்பீடு

source: Add Child
si: ළමයා එක් කරන්න
ta: குழந்தையைச் சேர்

source: View All
si: සියල්ල බලන්න
ta: அனைத்தையும் பார்

source: Recent Children
si: මෑතකදී ළමයි
ta: சமீபத்திய குழந்தைகள்

source: Total Children
si: සම්පූර්ණ ළමයි
ta: மொத்த குழந்தைகள்

source: Completed
si: සම්පූර්ණයි
ta: முடிந்தது

source: Pending
si: පොරොත්තුවෙන්
ta: நிலுவையில்

source: Today
si: අද
ta: இன்று

source: Statistics
si: සංඛ්‍යාන
ta: புள்ளிவிவரங்கள்

source: Quick Actions
si: ක්ෂණික ක්‍රියා
ta: விரைவு செயல்கள்

# searchChildren
source: Search children by name...
si: නමින් ළමයි සොයන්න...
ta: பெயரால் குழந்தைகளைத் தேடு...

# noChildren
source: No children added yet
si: තවමත් ළමයි එක් කර නැත
ta: இன்னும் குழந்தைகள் சேர்க்கப்படவில்லை

# addFirstChild
source: Add your first child to start assessments
si: තක්සේරු ආරම්භ කිරීමට ඔබේ පළමු ළමයා එක් කරන්න
ta: மதிப்பீடுகளைத் தொடங்க உங்கள் முதல் குழந்தையைச் சேர்க்கவும்

source: Child Name
si: ළමයාගේ නම
ta: குழந்தையின் பெயர்

source: Date of Birth
si: උපන් දිනය
ta: பிறந்த தேதி

source: Gender
si: ස්ත්‍රී පුරුෂ භාවය
ta: பாலினம்

source: Language
si: භාෂාව
ta: மொழி

source: Save
si: සුරකින්න
ta: சேமி

source: Cancel
si: අවලංගු කරන්න
ta: ரத்துசெய்

source: Male
si: පිරිමි
ta: ஆண்

source: Female
si: ගැහැණු
ta: பெண்

source: Other
si: වෙනත්
ta: மற்றவை

source: English
si: ඉංග්‍රීසි
ta: ஆங்கிலம்

source: Sinhala
si: සිංහල
ta: சிங்களம்

source: Tamil
si: දමිළ
ta: தமிழ்

source: Age
si: වයස
ta: வயது

source: years
si: වසර
ta: ஆண்டுகள்

source: months
si: මාස
ta: மாதங்கள்

source: Select Age
si: වයස තෝරන්න
ta: வயதைத் தேர்ந்தெடு

# enterAge
source: Enter Child Age
si: ළමයාගේ වයස ඇතුළත් කරන්න
ta: குழந்தையின் வயதை உள்ளிடவும்

# ageRange
source: Age must be between 2.0 and 6.0 years
si: වයස 2.0 සහ 6.0 වසර අතර විය යුතුය
ta: வயது 2.0 மற்றும் 6.0 ஆண்டுகளுக்கு இடையில் இருக்க வேண்டும்

source: START ASSESSMENT
si: තක්සේරුව ආරම්භ කරන්න
ta: மதிப்பீட்டைத் தொடங்கு

source: Age Groups
si: වයස් කණ්ඩායම්
ta: வயது குழுக்கள்

# ageGroup23
source: 2.0 - 3.4 years
si: 2.0 - 3.4 වසර
ta: 2.0 - 3.4 ஆண்டுகள்

# ageGroup35
source: 3.5 - 5.5 years
si: 3.5 - 5.5 වසර
ta: 3.5 - 5.5 ஆண்டுகள்

# ageGroup56
source: 5.6 - 6.0 years
si: 5.6 - 6.0 වසර
ta: 5.6 - 6.0 ஆண்டுகள்

# assessment23
source: Parent Interview Bot
si: මව්පිය සම්මුඛ සාකච්ඡා බොට්
ta: பெற்றோர் நேர்காணல் போட்

# assessment35
source: Frog Jump Game (Go/No-Go)
si: ගෙම්බා පැනීමේ ක්‍රීඩාව (Go/No-Go)
ta: தவளை குதிப்பு விளையாட்டு (Go/No-Go)

# assessment56
source: Color-Shape Game (DCCS)
si: වර්ණ-හැඩතල ක්‍රීඩාව (DCCS)
ta: நிறம்-வடிவ விளையாட்டு (DCCS)

source: AI Doctor Bot
si: AI වෛද්‍ය බොට්
ta: AI மருத்துவர் போட்

source: Question
si: ප්‍රශ්නය
ta: கேள்வி

# ofText
source: of
si: යි
ta: இல்

# aiQuestion1
source: Does {childName} respond when you call their name?
si: {childName} ඔබ ඔවුන්ගේ නම කියන විට ප්‍රතිචාර දක්වනවාද?
ta: {childName} நீங்கள் அவர்களின் பெயரை அழைக்கும்போது பதிலளிக்கிறார்களா?

# aiCategory1
source: Social Responsiveness
si: සමාජ ප්‍රතිචාරය
ta: சமூக பதிலளிப்பு

# aiQuestion1Option1
source: Always responds immediately
si: සැමවිටම වහාම ප්‍රතිචාර දක්වයි
ta: எப்போதும் உடனடியாக பதிலளிக்கிறார்கள்

# aiQuestion1Option2
source: Usually responds
si: සාමාන්‍යයෙන් ප්‍රතිචාර දක්වයි
ta: பொதுவாக பதிலளிக்கிறார்கள்

# aiQuestion1Option3
source: Sometimes responds
si: සමහර විට ප්‍රතිචාර දක්වයි
ta: சில நேரங்களில் பதிலளிக்கிறார்கள்

# aiQuestion1Option4
source: Rarely responds
si: අඩු වශයෙන් ප්‍රතිචාර දක්වයි
ta: அரிதாக பதிலளிக்கிறார்கள்

# aiQuestion1Option5
source: Never or almost never responds
si: කිසි විටක හෝ බොහෝ දුරට ප්‍රතිචාර නොදක්වයි
ta: எப்போதும் அல்லது கிட்டத்தட்ட பதிலளிக்க மாட்டார்கள்

# aiQuestion2
source: How does {childName} react when their daily routine changes?
si: {childName} ඔවුන්ගේ දෛනික රටාව වෙනස් වන විට කෙසේ ප්‍රතිචාර දක්වනවාද?
ta: {childName} அவர்களின் தினசரி வழக்கத்தில் மாற்றம் ஏற்படும்போது எவ்வாறு பதிலளிக்கிறார்கள்?

# aiCategory2
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# aiQuestion2Option1
source: Adapts easily to changes
si: වෙනස්කම් වලට පහසුවෙන් අනුවර්තනය වේ
ta: மாற்றங்களுக்கு எளிதாக ஏற்படுத்திக் கொள்கிறார்கள்

# aiQuestion2Option2
source: Needs a little time but adapts
si: ස්වල්ප කාලයක් අවශ්‍ය නමුත් අනුවර්තනය වේ
ta: கொஞ்சம் நேரம் தேவை ஆனால் ஏற்படுத்திக் கொள்கிறார்கள்

# aiQuestion2Option3
source: Shows some distress, eventually adapts
si: ස්වල්ප දුක් විඳින නමුත් අවසානයේ අනුවර්තනය වේ
ta: கொஞ்சம் வருத்தம் காட்டுகிறார்கள், இறுதியில் ஏற்படுத்திக் கொள்கிறார்கள்

# aiQuestion2Option4
source: Gets very upset, takes long to adapt
si: බෙහෙවින් කලබල වන අතර අනුවර්තනය වීමට බොහෝ කාලයක් ගත වේ
ta: மிகவும் கோபப்படுகிறார்கள், ஏற்படுத்திக் கொள்ள நீண்ட நேரம் ஆகிறது

# aiQuestion2Option5
source: Cannot adapt, extreme distress
si: අනුවර්තනය විය නොහැක, අතිශය දුක
ta: ஏற்படுத்திக் கொள்ள முடியாது, தீவிர வருத்தம்

# aiQuestion3
source: When playing with toys, does {childName} switch between different activities or toys?
si: ක්‍රීඩාවන් සමඟ සෙල්ලම් කරන විට, {childName} විවිධ ක්‍රියාකාරකම් හෝ ක්‍රීඩාවන් අතර මාරු වනවාද?
ta: விளையாட்டுகளுடன் விளையாடும்போது, {childName} வெவ்வேறு செயல்கள் அல்லது விளையாட்டுகளுக்கு இடையில் மாறுகிறார்களா?

# aiCategory3
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# aiQuestion3Option1
source: Easily switches between toys/activities
si: ක්‍රීඩාවන්/ක්‍රියාකාරකම් අතර පහසුවෙන් මාරු වේ
ta: விளையாட்டுகள்/செயல்களுக்கு இடையில் எளிதாக மாறுகிறார்கள்

# aiQuestion3Option2
source: Switches with gentle prompting
si: මෘදු උත්තේජනයකින් මාරු වේ
ta: மென்மையான தூண்டுதலுடன் மாறுகிறார்கள்

# aiQuestion3Option3
source: Switches but shows reluctance
si: මාරු වන නමුත් අකමැත්තක් පෙන්වයි
ta: மாறுகிறார்கள் ஆனால் விருப்பமின்மை காட்டுகிறார்கள்

# aiQuestion3Option4
source: Very difficult to get them to switch
si: ඔවුන්ව මාරු කිරීම ඉතා අපහසුය
ta: அவர்களை மாற்றுவது மிகவும் கடினம்

# aiQuestion3Option5
source: Refuses to switch, fixates on one toy
si: මාරු වීම ප්‍රතික්ෂේප කරයි, එක් ක්‍රීඩාවකට සිත යොමු කරයි
ta: மாற மறுக்கிறார்கள், ஒரு விளையாட்டில் மட்டும் கவனம் செலுத்துகிறார்கள்

# aiQuestion4
source: How often does {childName} make eye contact when you talk to them?
si: {childName} ඔබ ඔවුන් සමඟ කතා කරන විට කොපමණ වාර ගණනක් ඇස් සම්බන්ධතාවයක් ඇති කරගනීද?
ta: {childName} நீங்கள் அவர்களுடன் பேசும்போது எத்தனை முறை கண் தொடர்பு கொள்கிறார்கள்?

# aiCategory4
source: Social Communication
si: සමාජ සන්නිවේදනය
ta: சமூக தொடர்பு

# aiQuestion4Option1
source: Always makes good eye contact
si: සැමවිටම හොඳ ඇස් සම්බන්ධතාවයක් ඇති කරගනී
ta: எப்போதும் நல்ல கண் தொடர்பு கொள்கிறார்கள்

# aiQuestion4Option2
source: Usually makes eye contact
si: සාමාන්‍යයෙන් ඇස් සම්බන්ධතාවයක් ඇති කරගනී
ta: பொதுவாக கண் தொடர்பு கொள்கிறார்கள்

# aiQuestion4Option3
source: Sometimes makes eye contact
si: සමහර විට ඇස් සම්බන්ධතාවයක් ඇති කරගනී
ta: சில நேரங்களில் கண் தொடர்பு கொள்கிறார்கள்

# aiQuestion4Option4
source: Rarely makes eye contact
si: අඩු වශයෙන් ඇස් සම්බන්ධතාවයක් ඇති කරගනී
ta: அரிதாக கண் தொடர்பு கொள்கிறார்கள்

# aiQuestion4Option5
source: Avoids eye contact completely
si: ඇස් සම්බන්ධතාවය සම්පූර්ණයෙන්ම වළක්වයි
ta: கண் தொடர்பை முற்றிலும் தவிர்க்கிறார்கள்

# aiQuestion5
source: Does {childName} point to objects they want or find interesting?
si: {childName} ඔවුන්ට අවශ්‍ය හෝ රසවත් වන වස්තූන් දෙසට අඟලින් යොමු කරනවාද?
ta: {childName} அவர்கள் விரும்பும் அல்லது ஆர்வமுள்ள பொருட்களை சுட்டிக் காட்டுகிறார்களா?

# aiCategory5
source: Joint Attention
si: එක්ව අවධානය
ta: கூட்டு கவனம்

# aiQuestion5Option1
source: Frequently points and shares interest
si: නිතර අඟලින් යොමු කරන අතර උනන්දුව බෙදාගනී
ta: அடிக்கடி சுட்டிக் காட்டி ஆர்வத்தை பகிர்கிறார்கள்

# aiQuestion5Option2
source: Often points to things
si: බොහෝ විට දේවල් දෙසට අඟලින් යොමු කරයි
ta: பெரும்பாலும் பொருட்களை சுட்டிக் காட்டுகிறார்கள்

# aiQuestion5Option3
source: Occasionally points
si: සමහර විට අඟලින් යොමු කරයි
ta: எப்போதாவது சுட்டிக் காட்டுகிறார்கள்

# aiQuestion5Option4
source: Rarely points
si: අඩු වශයෙන් අඟලින් යොමු කරයි
ta: அரிதாக சுட்டிக் காட்டுகிறார்கள்

# aiQuestion5Option5
source: Never or almost never points
si: කිසි විටක හෝ බොහෝ දුරට අඟලින් යොමු නොකරයි
ta: எப்போதும் அல்லது கிட்டத்தட்ட சுட்டிக் காட்ட மாட்டார்கள்

# aiQuestion6
source: How does {childName} react to unexpected sounds or sensory experiences?
si: {childName} අනපේක්ෂිත ශබ්ද හෝ එන්ද්‍රිය අත්දැකීම් වලට කෙසේ ප්‍රතිචාර දක්වනවාද?
ta: {childName} எதிர்பாராத ஒலிகள் அல்லது புலனுணர்வு அனுபவங்களுக்கு எவ்வாறு பதிலளிக்கிறார்கள்?

# aiCategory6
source: Sensory Processing
si: එන්ද්‍රිය සැකසීම
ta: புலனுணர்வு செயலாக்கம்

# aiQuestion6Option1
source: Reacts appropriately, recovers quickly
si: සුදුසු ලෙස ප්‍රතිචාර දක්වන අතර වහාම සුව වේ
ta: பொருத்தமாக பதிலளிக்கிறார்கள், விரைவாக மீட்கிறார்கள்

# aiQuestion6Option2
source: Startles but calms down soon
si: විස්මයට පත් වන නමුත් ඉක්මනින් සන්සුන් වේ
ta: திடுக்கிடுகிறார்கள் ஆனால் விரைவில் அமைதியடைகிறார்கள்

# aiQuestion6Option3
source: Gets upset, needs comfort
si: කලබල වන අතර සැනසීමක් අවශ්‍ය වේ
ta: கோபப்படுகிறார்கள், ஆறுதல் தேவை

# aiQuestion6Option4
source: Very distressed, takes long to calm
si: බෙහෙවින් කලබල වන අතර සන්සුන් වීමට බොහෝ කාලයක් ගත වේ
ta: மிகவும் வருத்தப்படுகிறார்கள், அமைதியடைய நீண்ட நேரம் ஆகிறது

# aiQuestion6Option5
source: Extreme distress or complete shutdown
si: අතිශය දුක හෝ සම්පූර්ණ නැවතීම
ta: தீவிர வருத்தம் அல்லது முழுமையான நிறுத்தம்

# aiQuestion7
source: Does {childName} imitate your actions or words?
si: {childName} ඔබගේ ක්‍රියා හෝ වචන අනුකරණය කරනවාද?
ta: {childName} உங்கள் செயல்கள் அல்லது வார்த்தைகளை பின்பற்றுகிறார்களா?

# aiCategory7
source: Social Learning
si: සමාජ ඉගෙනීම
ta: சமூக கற்றல்

# aiQuestion7Option1
source: Frequently imitates spontaneously
si: නිතර ස්වයංක්‍රීයව අනුකරණය කරයි
ta: அடிக்கடி தன்னிச்சையாக பின்பற்றுகிறார்கள்

# aiQuestion7Option2
source: Often imitates when prompted
si: උත්තේජනය කළ විට බොහෝ විට අනුකරණය කරයි
ta: தூண்டப்படும்போது பெரும்பாலும் பின்பற்றுகிறார்கள்

# aiQuestion7Option3
source: Imitates some simple actions
si: සමහර සරල ක්‍රියා අනුකරණය කරයි
ta: சில எளிய செயல்களை பின்பற்றுகிறார்கள்

# aiQuestion7Option4
source: Rarely imitates
si: අඩු වශයෙන් අනුකරණය කරයි
ta: அரிதாக பின்பற்றுகிறார்கள்

# aiQuestion7Option5
source: Never or almost never imitates
si: කිසි විටක හෝ බොහෝ දුරට අනුකරණය නොකරයි
ta: எப்போதும் அல்லது கிட்டத்தட்ட பின்பற்ற மாட்டார்கள்

# aiQuestion8
source: How does {childName} play with other children?
si: {childName} වෙනත් ළමයින් සමඟ කෙසේ සෙල්ලම් කරනවාද?
ta: {childName} மற்ற குழந்தைகளுடன் எவ்வாறு விளையாடுகிறார்கள்?

# aiCategory8
source: Social Interaction
si: සමාජ අන්තර්ක්‍රියාව
ta: சமூக தொடர்பு

# aiQuestion8Option1
source: Actively engages and shares
si: සක්‍රීයව සම්බන්ධ වන අතර බෙදාගනී
ta: சுறுசுறுப்பாக ஈடுபட்டு பகிர்கிறார்கள்

# aiQuestion8Option2
source: Plays near others, some interaction
si: වෙනත් අය අසල සෙල්ලම් කරන අතර ස්වල්ප අන්තර්ක්‍රියාවක් ඇත
ta: மற்றவர்களுக்கு அருகில் விளையாடுகிறார்கள், கொஞ்சம் தொடர்பு

# aiQuestion8Option3
source: Parallel play, minimal interaction
si: සමාන්තර සෙල්ලම, අවම අන්තර්ක්‍රියාව
ta: இணை விளையாட்டு, குறைந்த தொடர்பு

# aiQuestion8Option4
source: Prefers solitary play, avoids others
si: තනිවම සෙල්ලම් කිරීමට කැමති, වෙනත් අය වළක්වයි
ta: தனியாக விளையாடுவதை விரும்புகிறார்கள், மற்றவர்களை தவிர்க்கிறார்கள்

# aiQuestion8Option5
source: No interest in other children
si: වෙනත් ළමයින් කෙරෙහි උනන්දුවක් නැත
ta: மற்ற குழந்தைகளில் ஆர்வம் இல்லை

# aiQuestion9
source: Does {childName} show interest when you show them something?
si: {childName} ඔබ ඔවුන්ට යමක් පෙන්වන විට උනන්දුවක් පෙන්වනවාද?
ta: {childName} நீங்கள் அவர்களுக்கு ஏதாவது காட்டும்போது ஆர்வம் காட்டுகிறார்களா?

# aiCategory9
source: Joint Attention
si: එක්ව අවධානය
ta: கூட்டு கவனம்

# aiQuestion9Option1
source: Always looks and shows interest
si: සැමවිටම බලන අතර උනන්දුව පෙන්වයි
ta: எப்போதும் பார்த்து ஆர்வம் காட்டுகிறார்கள்

# aiQuestion9Option2
source: Usually looks when you point
si: ඔබ අඟලින් යොමු කරන විට සාමාන්‍යයෙන් බලයි
ta: நீங்கள் சுட்டும்போது பொதுவாக பார்க்கிறார்கள்

# aiQuestion9Option3
source: Sometimes follows your gaze/point
si: සමහර විට ඔබගේ ඇස හෝ අඟලින් යොමු කිරීම අනුගමනය කරයි
ta: சில நேரங்களில் உங்கள் பார்வை/சுட்டியை பின்பற்றுகிறார்கள்

# aiQuestion9Option4
source: Rarely follows your attention
si: අඩු වශයෙන් ඔබගේ අවධානය අනුගමනය කරයි
ta: அரிதாக உங்கள் கவனத்தை பின்பற்றுகிறார்கள்

# aiQuestion9Option5
source: Never follows your gaze or point
si: කිසි විටක ඔබගේ ඇස හෝ අඟලින් යොමු කිරීම අනුගමනය නොකරයි
ta: எப்போதும் உங்கள் பார்வை அல்லது சுட்டியை பின்பற்ற மாட்டார்கள்

# aiQuestion10
source: How does {childName} express their needs or wants?
si: {childName} ඔවුන්ගේ අවශ්‍යතා හෝ අභිලාෂයන් ප්‍රකාශ කරන්නේ කෙසේද?
ta: {childName} அவர்களின் தேவைகள் அல்லது விருப்பங்களை எவ்வாறு வெளிப்படுத்துகிறார்கள்?

# aiCategory10
source: Communication
si: සන්නිවේදනය
ta: தொடர்பு

# aiQuestion10Option1
source: Uses words and gestures clearly
si: වචන සහ අඟලින් යොමු කිරීම් පැහැදිලිව භාවිතා කරයි
ta: வார்த்தைகள் மற்றும் சைகைகளை தெளிவாக பயன்படுத்துகிறார்கள்

# aiQuestion10Option2
source: Uses gestures and some words
si: අඟලින් යොමු කිරීම් සහ සමහර වචන භාවිතා කරයි
ta: சைகைகள் மற்றும் சில வார்த்தைகளை பயன்படுத்துகிறார்கள்

# aiQuestion10Option3
source: Mostly gestures, few words
si: බොහෝ දුරට අඟලින් යොමු කිරීම්, ස්වල්ප වචන
ta: பெரும்பாலும் சைகைகள், சில வார்த்தைகள்

# aiQuestion10Option4
source: Pulls you to objects, little gesture
si: වස්තූන් දෙසට ඔබව ඇදගෙන යයි, ස්වල්ප අඟලින් යොමු කිරීම්
ta: பொருட்களை நோக்கி உங்களை இழுக்கிறார்கள், கொஞ்சம் சைகை

# aiQuestion10Option5
source: Cries or tantrums, no clear communication
si: කඳුළු හෝ කෝපය, පැහැදිලි සන්නිවේදනයක් නැත
ta: அழுகிறார்கள் அல்லது கோபப்படுகிறார்கள், தெளிவான தொடர்பு இல்லை

# reflectionQuestionAttention
source: How well did the child maintain attention during the game?
si: ළමයා ක්‍රීඩාව අතරතුර කොපමණ හොඳින් අවධානය පවත්වා ගත්තාද?
ta: குழந்தை விளையாட்டின் போது எவ்வளவு நன்றாக கவனத்தை பராமரித்தது?

# reflectionLabelAttention
source: Attention Level
si: අවධානය මට්ටම
ta: கவனம் நிலை

# reflectionQuestionEngagement
source: How engaged was the child with the game activities?
si: ළමයා ක්‍රීඩා ක්‍රියාකාරකම් සමඟ කොපමණ දුරට සම්බන්ධ වී සිටියාද?
ta: குழந்தை விளையாட்டு செயல்களில் எவ்வளவு ஈடுபட்டது?

# reflectionLabelEngagement
source: Engagement Level
si: සම්බන්ධතාවය මට්ටම
ta: ஈடுபாடு நிலை

# reflectionQuestionFrustration
source: How did the child handle frustration or mistakes?
si: ළමයා කලබලය හෝ වැරදි සමඟ කෙසේ කටයුතු කළාද?
ta: குழந்தை வருத்தம் அல்லது தவறுகளை எவ்வாறு கையாண்டது?

# reflectionLabelFrustration
source: Frustration Tolerance
si: කලබලය ඉවසීම
ta: வருத்தம் சகிப்புத்தன்மை

# reflectionQuestionInstructions
source: How well did the child follow game instructions?
si: ළමයා ක්‍රීඩා උපදෙස් කොපමණ හොඳින් අනුගමනය කළාද?
ta: குழந்தை விளையாட்டு வழிமுறைகளை எவ்வளவு நன்றாக பின்பற்றியது?

# reflectionLabelInstructions
source: Following Instructions
si: උපදෙස් අනුගමනය කිරීම
ta: வழிமுறைகளை பின்பற்றுதல்

# reflectionQuestionOverall
source: Overall, how would you rate the child's behavior during assessment?
si: සමස්තයක් වශයෙන්, තක්සේරුව අතරතුර ළමයාගේ හැසිරීම ඔබ කෙසේ තක්සේරු කරනවාද?
ta: மொத்தத்தில், மதிப்பீட்டின் போது குழந்தையின் நடத்தையை நீங்கள் எவ்வாறு மதிப்பீடு செய்வீர்கள்?

# reflectionLabelOverall
source: Overall Behavior
si: සමස්ත හැසිරීම
ta: மொத்த நடத்தை

# manualTask1Title
source: Rule Switching Task - Color/Shape
si: නීති මාරු කිරීමේ කාර්යය - වර්ණ/හැඩය
ta: விதி மாற்ற பணி - நிறம்/வடிவம்

# manualTask1Description
source: Did the child switch between sorting by color and shape?
si: ළමයා වර්ණයෙන් සහ හැඩයෙන් වර්ගීකරණය අතර මාරු වුණාද?
ta: குழந்தை நிறம் மற்றும் வடிவத்தால் வரிசைப்படுத்துவதற்கு இடையில் மாறியதா?

# manualTask1Label
source: Rule Switching Ability
si: නීති මාරු කිරීමේ හැකියාව
ta: விதி மாற்ற திறன்

# manualTask1Task
source: Give child blocks of different colors and shapes. First ask to sort by COLOR, then switch to SHAPE. Observe if child can switch rules.
si: ළමයාට විවිධ වර්ණ සහ හැඩවල ගොඩක් දෙන්න. පළමුව වර්ණයෙන් වර්ගීකරණය කරන ලෙස අසන්න, පසුව හැඩයට මාරු වන්න. ළමයාට නීති මාරු කිරීමට හැකිදැයි නිරීක්ෂණය කරන්න.
ta: குழந்தைக்கு வெவ்வேறு நிறங்கள் மற்றும் வடிவங்களின் தொகுதிகளை கொடுங்கள். முதலில் நிறத்தால் வரிசைப்படுத்தும்படி கேளுங்கள், பின்னர் வடிவத்திற்கு மாறுங்கள். குழந்தை விதிகளை மாற்ற முடியுமா என்பதை கவனிக்கவும்.

# manualTask1Category
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# manualTask2Title
source: Follow Changing Instructions
si: වෙනස් වන උපදෙස් අනුගමනය කිරීම
ta: மாறும் வழிமுறைகளை பின்பற்றுதல்

# manualTask2Description
source: Did the child adapt when instructions changed?
si: උපදෙස් වෙනස් වූ විට ළමයා අනුවර්තනය වුණාද?
ta: வழிமுறைகள் மாறியபோது குழந்தை ஏற்படுத்திக் கொண்டதா?

# manualTask2Label
source: Instruction Flexibility
si: උපදෙස් නම්යශීලීභාවය
ta: வழிமுறை நெகிழ்வுத்தன்மை

# manualTask2Task
source: Give child simple instructions that change (e.g., "Put the red block here" then "Now put the blue block there"). Observe adaptation.
si: ළමයාට වෙනස් වන සරල උපදෙස් දෙන්න (උදා: "රතු ගොඩක් මෙහි දමන්න" පසුව "දැන් නිල් ගොඩක් එහි දමන්න"). අනුවර්තනය නිරීක්ෂණය කරන්න.
ta: குழந்தைக்கு மாறும் எளிய வழிமுறைகளை கொடுங்கள் (எ.கா: "சிவப்பு தொகுதியை இங்கே வைக்கவும்" பின்னர் "இப்போது நீல தொகுதியை அங்கே வைக்கவும்"). ஏற்படுத்திக் கொள்ளுதலை கவனிக்கவும்.

# manualTask2Category
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# manualTask3Title
source: Inhibition Task - Go/No-Go
si: නැවැත්වීමේ කාර්යය - Go/No-Go
ta: தடுப்பு பணி - Go/No-Go

# manualTask3Description
source: Did the child inhibit responses when told not to?
si: ළමයාට නොකරන ලෙස කියන විට ප්‍රතිචාර නැවැත්වුණාද?
ta: குழந்தைக்கு செய்யக்கூடாது என்று சொல்லும்போது பதில்களை தடுத்ததா?

# manualTask3Label
source: Response Inhibition
si: ප්‍රතිචාර නැවැත්වීම
ta: பதில் தடுப்பு

# manualTask3Task
source: Play a simple game: "When I say GO, clap. When I say STOP, don't clap." Observe if child can inhibit clapping on STOP.
si: සරල ක්‍රීඩාවක් සෙල්ලම් කරන්න: "මම GO කියන විට, අත්පොල්සන්න. මම STOP කියන විට, අත්පොල්සන්න එපා." ළමයාට STOP හිදී අත්පොල්සන්න නැවැත්වීමට හැකිදැයි නිරීක්ෂණය කරන්න.
ta: ஒரு எளிய விளையாட்டை விளையாடுங்கள்: "நான் GO என்று சொல்லும்போது, கைதட்டுங்கள். நான் STOP என்று சொல்லும்போது, கைதட்ட வேண்டாம்." குழந்தை STOP இல் கைதட்டலை தடுக்க முடியுமா என்பதை கவனிக்கவும்.

# manualTask3Category
source: Inhibition Control
si: නැවැත්වීමේ පාලනය
ta: தடுப்பு கட்டுப்பாடு

# manualTask4Title
source: Perseveration Observation
si: නැවත නැවත කිරීමේ නිරීක්ෂණය
ta: மீண்டும் மீண்டும் செய்தல் கவனிப்பு

# manualTask4Description
source: Did the child get stuck on one activity or rule?
si: ළමයා එක් ක්‍රියාකාරකමක හෝ නීතියක සිරවී ගියාද?
ta: குழந்தை ஒரு செயலில் அல்லது விதியில் சிக்கிக் கொண்டதா?

# manualTask4Label
source: Perseveration
si: නැවත නැවත කිරීම
ta: மீண்டும் மீண்டும் செய்தல்

# manualTask4Task
source: After switching rules, observe if child continues with old rule (perseveration) or adapts to new rule.
si: නීති මාරු කිරීමෙන් පසු, ළමයා පැරණි නීතිය සමඟ ඉදිරියට යනවාද (නැවත නැවත කිරීම) නැතහොත් නව නීතියට අනුවර්තනය වනවාද යන්න නිරීක්ෂණය කරන්න.
ta: விதிகளை மாற்றிய பிறகு, குழந்தை பழைய விதியுடன் தொடர்கிறதா (மீண்டும் மீண்டும் செய்தல்) அல்லது புதிய விதிக்கு ஏற்படுத்திக் கொள்கிறதா என்பதை கவனிக்கவும்.

# manualTask4Category
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# manualTask5Title
source: Task Switching - Play Activities
si: කාර්ය මාරු කිරීම - සෙල්ලම් ක්‍රියාකාරකම්
ta: பணி மாற்றம் - விளையாட்டு செயல்கள்

# manualTask5Description
source: How well did the child switch between different play activities?
si: ළමයා විවිධ සෙල්ලම් ක්‍රියාකාරකම් අතර කොපමණ හොඳින් මාරු වුණාද?
ta: குழந்தை வெவ்வேறு விளையாட்டு செயல்களுக்கு இடையில் எவ்வளவு நன்றாக மாறியது?

# manualTask5Label
source: Activity Switching
si: ක්‍රියාකාරකම් මාරු කිරීම
ta: செயல் மாற்றம்

# manualTask5Task
source: Have child play with blocks, then ask to switch to drawing, then to toy. Observe ease of switching between activities.
si: ළමයාට ගොඩක් සමඟ සෙල්ලම් කරන්න, පසුව ඇඳීමට මාරු වන ලෙස අසන්න, පසුව ක්‍රීඩාවට. ක්‍රියාකාරකම් අතර මාරු වීමේ පහසුව නිරීක්ෂණය කරන්න.
ta: குழந்தை தொகுதிகளுடன் விளையாடட்டும், பின்னர் வரைவதற்கு மாறும்படி கேளுங்கள், பின்னர் பொம்மைக்கு. செயல்களுக்கு இடையில் மாறுவதன் எளிமையை கவனிக்கவும்.

# manualTask5Category
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# behavioralQuestionRuleSwitching
source: How well did the child demonstrate cognitive flexibility during rule-switching tasks?
si: නීති මාරු කිරීමේ කාර්යයන් අතරතුර ළමයා ඥානාත්මක නම්යශීලීභාවය කොපමණ හොඳින් පෙන්වුවාද?
ta: விதி மாற்ற பணிகளின் போது குழந்தை அறிவாற்றல் நெகிழ்வுத்தன்மையை எவ்வளவு நன்றாக நிரூபித்தது?

# behavioralLabelRuleSwitching
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# behavioralCategoryRuleSwitching
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# behavioralQuestionAttention
source: How well did the child maintain attention during the manual tasks?
si: අතින් කරන කාර්යයන් අතරතුර ළමයා කොපමණ හොඳින් අවධානය පවත්වා ගත්තාද?
ta: கைமுறை பணிகளின் போது குழந்தை எவ்வளவு நன்றாக கவனத்தை பராமரித்தது?

# behavioralLabelAttention
source: Attention Level
si: අවධානය මට්ටම
ta: கவனம் நிலை

# behavioralCategoryAttention
source: Attention
si: අවධානය
ta: கவனம்

# behavioralQuestionFrustration
source: How did the child handle frustration when tasks became difficult or rules changed?
si: කාර්යයන් අපහසු වූ විට හෝ නීති වෙනස් වූ විට ළමයා කලබලය සමඟ කෙසේ කටයුතු කළාද?
ta: பணிகள் கடினமானபோது அல்லது விதிகள் மாறியபோது குழந்தை வருத்தத்தை எவ்வாறு கையாண்டது?

# behavioralLabelFrustration
source: Frustration Tolerance
si: කලබලය ඉවසීම
ta: வருத்தம் சகிப்புத்தன்மை

# behavioralCategoryFrustration
source: Emotional Regulation
si: චිත්තවේගීය නියාමනය
ta: உணர்ச்சி ஒழுங்குமுறை

# behavioralQuestionPerseveration
source: Did you observe any repetitive behaviors or getting stuck on one activity?
si: ඔබ නැවත නැවත හැසිරීම් හෝ එක් ක්‍රියාකාරකමක සිරවී යාම නිරීක්ෂණය කළාද?
ta: நீங்கள் எந்த மீண்டும் மீண்டும் நடத்தைகள் அல்லது ஒரு செயலில் சிக்கிக் கொள்ளுதலை கவனித்தீர்களா?

# behavioralLabelPerseveration
source: Perseveration Behavior
si: නැවත නැවත හැසිරීම
ta: மீண்டும் மீண்டும் நடத்தை

# behavioralCategoryPerseveration
source: Cognitive Flexibility
si: ඥානාත්මක නම්යශීලීභාවය
ta: அறிவாற்றல் நெகிழ்வுத்தன்மை

# behavioralQuestionOverall
source: Overall, how would you rate the child's cognitive flexibility and rule-switching abilities?
si: සමස්තයක් වශයෙන්, ළමයාගේ ඥානාත්මක නම්යශීලීභාවය සහ නීති මාරු කිරීමේ හැකියාවන් ඔබ කෙසේ තක්සේරු කරනවාද?
ta: மொத்தத்தில், குழந்தையின் அறிவாற்றல் நெகிழ்வுத்தன்மை மற்றும் விதி மாற்றும் திறன்களை நீங்கள் எவ்வாறு மதிப்பீடு செய்வீர்கள்?

# behavioralLabelOverall
source: Overall Cognitive Flexibility
si: සමස්ත ඥානාත්මක නම්යශීලීභාවය
ta: மொத்த அறிவாற்றல் நெகிழ்வுத்தன்மை

# behavioralCategoryOverall
source: Overall Assessment
si: සමස්ත තක්සේරුව
ta: மொத்த மதிப்பீடு

# scaleAttention1
source: Very Poor
si: ඉතා දුර්වල
ta: மிகவும் மோசமான

# scaleAttention2
source: Poor
si: දුර්වල
ta: மோசமான

# scaleAttention3
source: Average
si: සාමාන්‍ය
ta: சராசரி

# scaleAttention4
source: Good
si: හොඳ
ta: நல்ல

# scaleAttention5
source: Excellent
si: විශිෂ්ට
ta: சிறந்த

# scaleEngagement1
source: Not Engaged
si: සම්බන්ධ නොවී
ta: ஈடுபடாத

# scaleEngagement2
source: Minimal
si: අවම
ta: குறைந்த

# scaleEngagement3
source: Moderate
si: මධ්‍යම
ta: மிதமான

# scaleEngagement4
source: Good
si: හොඳ
ta: நல்ல

# scaleEngagement5
source: Very Engaged
si: බෙහෙවින් සම්බන්ධ
ta: மிகவும் ஈடுபட்ட

# scaleFrustration1
source: Very Low
si: ඉතා අඩු
ta: மிகவும் குறைந்த
